Catalogs/ПлатформенныеОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ПлатформенныеОбработки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПредопределенныйЭлемент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИменаПодключения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючевоеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолныйПуть</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПлатформенныеОбработки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет эталонные (предопределенные) данные
//
Процедура ЗаполнитьЭталонныеДанные() Экспорт
	
	ЭталонныеДанные = ЭталонныеДанные();
	Для Каждого ТекущиеДанные Из ЭталонныеДанные Цикл
		СоздатьЭталонныйЭлемент(ТекущиеДанные);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭталонныеДанные()
	
	ТабличныйДокумент = Справочники.ПлатформенныеОбработки.ПолучитьМакет("ПредопределенныеДанные");
	
	ОбластьЯчеек   = ТабличныйДокумент.Область(1, 1, 
	ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы);

    ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);

    ПостроительОтчета = Новый ПостроительОтчета;
    ПостроительОтчета.ИсточникДанных = ИсточникДанных;
    ПостроительОтчета.Выполнить();

    Возврат ПостроительОтчета.Результат.Выгрузить();
	
КонецФункции

Процедура СоздатьЭталонныйЭлемент(ОписаниеДанных)
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор(ОписаниеДанных.УникальныйИдентификатор);
	ТекущаяСсылка = ПолучитьСсылку(УникальныйИдентификатор);
	Если СсылкаСуществует(ТекущаяСсылка) Тогда
		ТекущийОбъект = ТекущаяСсылка.ПолучитьОбъект();
	Иначе
		ТекущийОбъект = СоздатьЭлемент();
		ТекущийОбъект.УстановитьСсылкуНового(ТекущаяСсылка);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ТекущийОбъект, ОписаниеДанных);
	
	ТекущийОбъект.ИменаПодключения.Очистить();
	КлючевыеИмена = СтрРазделить(ОписаниеДанных.КлючевыеИмена, "," + Символы.ПС, Ложь);
	Для Каждого КлючевоеИмя Из КлючевыеИмена Цикл
		ТекущийОбъект.ИменаПодключения.Добавить().КлючевоеИмя = СокрЛП(КлючевоеИмя);
	КонецЦикла;
	
	ТекущийОбъект.Записать();
	
КонецПроцедуры

Функция СсылкаСуществует(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	Справочник.ПлатформенныеОбработки
	|ГДЕ
	|	Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Возврат НЕ Запрос.Выполнить().Пустой();
		
КонецФункции

#КонецОбласти

#КонецЕсли
